In [3]:
import numpy as np
import pandas as pd
books=pd.read_csv('Books.csv',low_memory=False)
books.head(2)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...

In [4]:
books.columns

Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',
       'Image-URL-S', 'Image-URL-M', 'Image-URL-L'],
      dtype='object')

In [5]:
books=books[['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher']]
books.head(2)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada

In [6]:
books.rename(columns={'Book-Title':'title','Book-Author':'author','Year-Of-Publication':'year','Publication':'publication'},inplace=True)
books['title']=books['title'].str.lower()
books.head(2)

,ISBN,title,author,year,Publisher
0,0195153448,classical mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,clara callan,Richard Bruce Wright,2001,HarperFlamingo Canada

In [7]:
users=pd.read_csv('Users.csv',low_memory=False)
users.rename(columns={'User-ID':'user-id','Location':'location','Age':'age'},inplace=True)
users=users[(users.age>=15) & (users.age<=100)]
users.head(2)

   user-id                   location   age
1        2  stockton, california, usa  18.0
3        4  porto, v.n.gaia, portugal  17.0

In [8]:
ratings=pd.read_csv('Ratings.csv',low_memory=False)
ratings.rename(columns={'User-ID':'user-id','Book-Rating':'rating'},inplace=True)
ratings.head(2)

   user-id        ISBN  rating
0   276725  034545104X       0
1   276726  0155061224       5

In [9]:
books.shape

(271360, 5)

In [10]:
users.shape

(163417, 3)

In [11]:
x=ratings['user-id'].value_counts()>200
y=x[x].index
ratings=ratings[ratings['user-id'].isin(y)]
ratings.head()

      user-id        ISBN  rating
1456   277427  002542730X      10
1457   277427  0026217457       0
1458   277427  003008685X       8
1459   277427  0030615321       0
1460   277427  0060002050       0

In [12]:
rated_books=ratings.merge(books,on='ISBN')
rated_books.head(2)

,user-id,ISBN,rating,title,author,year,Publisher
0,277427,002542730X,10,politically correct bedtime stories: modern ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc
1,3363,002542730X,0,politically correct bedtime stories: modern ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc

In [13]:
rating_cnt=rated_books.groupby('title')['rating'].count().reset_index()
rating_cnt.rename(columns={'rating':'rating_count'},inplace='True')
rating_cnt.head(2)

                                               title  rating_count
0   a light in the storm: the civil war diary of ...             2
1                              always have popsicles             1

In [14]:
final_ratings=rated_books.merge(rating_cnt,on='title')
final_ratings=final_ratings[final_ratings['rating_count']>=50]
final_ratings.head(2)

,user-id,ISBN,rating,title,author,year,Publisher,rating_count
0,277427,002542730X,10,politically correct bedtime stories: modern ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
1,3363,002542730X,0,politically correct bedtime stories: modern ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82

In [15]:
final_ratings.shape

(63336, 8)

In [16]:
final_ratings.drop_duplicates(['user-id','title'],inplace=True)
final_ratings.shape

(61137, 8)

In [17]:
final_ratings.head()

,user-id,ISBN,rating,title,author,year,Publisher,rating_count
0,277427,002542730X,10,politically correct bedtime stories: modern ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
1,3363,002542730X,0,politically correct bedtime stories: modern ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
2,11676,002542730X,6,politically correct bedtime stories: modern ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
3,12538,002542730X,10,politically correct bedtime stories: modern ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
4,13552,002542730X,0,politically correct bedtime stories: modern ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82

In [18]:
book_pivot=final_ratings.pivot_table(columns='user-id',index='title',values='rating')
book_pivot.head(2)

user-id,254,2276,2766,2977,3363,3757,4017,4385,6242,6251,...,274004,274061,274301,274308,274808,275970,277427,277478,277639,278418
title,,,,,,,,,,,,,,,,,,,,,
1984,9.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,NaN
1st to die: a novel,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [19]:
book_pivot.fillna(0,inplace=True)
book_pivot.head(2)

user-id,254,2276,2766,2977,3363,3757,4017,4385,6242,6251,...,274004,274061,274301,274308,274808,275970,277427,277478,277639,278418
title,,,,,,,,,,,,,,,,,,,,,
1984,9.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1st to die: a novel,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [20]:
from scipy.sparse import csr_matrix
book_sparse=csr_matrix(book_pivot)
from sklearn.neighbors import NearestNeighbors
model=NearestNeighbors(metric='cosine',algorithm='brute')
model.fit(book_sparse)

NearestNeighbors(algorithm='brute', metric='cosine')

In [21]:
def recommend(title):
    title=title.lower()
    try:
        id=np.where(book_pivot.index==title)[0][0]

        distances, suggestions=model.kneighbors(book_pivot.iloc[id, :].values.reshape(1,-1), n_neighbors=11)
        
        for i in range(1,len(suggestions[0])):
            print(book_pivot.index[suggestions[0][i]].title())
            
    except:
        print("0 results\nTop Rated Books")

        top10=final_ratings.sort_values('rating_count',ascending=False)
        top10.drop_duplicates(['title'],inplace=True)
        x=top10.head(10)['title']
        for i in x:
            print("\t",i.title())

In [23]:
book_title=input()
recommend(book_title)

A Civil Action
Silent Witness
Table For Two
The Temple Of My Familiar
Family Album
A Thousand Acres (Ballantine Reader'S Circle)
Tell No One
Sleepers
Truly, Madly Manhattan
Taltos: Lives Of The Mayfair Witches